DataProcessors/упРМТорговогоПредставителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМТорговогоПредставителя</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>дрвРаботыПоТекущемуРейсу</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнеры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРейсов</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданияПоРейсам</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/упГрузовыеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГрузовыеМеста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БеречьОтВлаги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтИзлучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтНагрева</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыемкаИнкассируемыхЦенностейВТочкеРазгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступнаяФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упДоступныеФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноПробитиеЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноСкладироватьДругНаДруга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контейнер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийГрузПоЗаявке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаПредоплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хрупкий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварныйСоставГруза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНоменклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковкаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упУпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитическийРазрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/упРМТорговогоПредставителя/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Заполняет дерево работ по переданному рейсу. 
//
Процедура ЗаполнитьДеревоРаботПоРейсу(ИзменитьТолькоВыполненные = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	сткДопПараметры = Новый Структура();
	сткДопПараметры.Вставить("ЗаданияПоРейсам", ЗаданияПоРейсам);
	упПрохождениеТочки.ЗаполнитьДеревоРаботПоРейсу(дрвРаботыПоТекущемуРейсу, , ТекущийРейс, Ложь, сткДопПараметры);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ЗаполнитьСписокРейсов() Экспорт
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	упПрохождениеТочки.ЗаполнитьСписокРейсовПоПолучателю(СписокРейсов, ЗаданияПоРейсам, Партнеры, Период.ДатаНачала, Период.ДатаОкончания, Отказ);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьТоварныйСостав(ПрохождениеТочки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварныйСоставГруза.Ссылка КАК Ссылка,
	|	ТоварныйСоставГруза.НомерСтроки КАК НомерСтроки,
	|	ТоварныйСоставГруза.АдресРазгрузки КАК АдресРазгрузки,
	|	ТоварныйСоставГруза.АналитическийРазрез КАК АналитическийРазрез,
	|	ТоварныйСоставГруза.ЕдиныйГруз КАК ЕдиныйГруз,
	|	ТоварныйСоставГруза.Количество КАК Количество,
	|	ТоварныйСоставГруза.Номенклатура КАК Номенклатура,
	|	ТоварныйСоставГруза.Проблема КАК Проблема,
	|	ТоварныйСоставГруза.СтавкаНДС КАК СтавкаНДС,
	|	ТоварныйСоставГруза.Сумма КАК Сумма,
	|	ТоварныйСоставГруза.СуммаБезНДС КАК СуммаБезНДС,
	|	ТоварныйСоставГруза.СуммаНДС КАК СуммаНДС,
	|	ТоварныйСоставГруза.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
	|	ТоварныйСоставГруза.Цена КАК Цена,
	|	ПРЕДСТАВЛЕНИЕ(ТоварныйСоставГруза.ЗаданиеНаПеревозкуГруза) КАК ЗаданиеНаПеревозкуГруза,
	|	ТоварныйСоставГруза.ГрузовоеМестоРодитель КАК ГрузовоеМесто,
	|	ТоварныйСоставГруза.КоличествоГрузов КАК КоличествоГрузов,
	|	ТоварныйСоставГруза.Выполнена КАК Выполнена,
	|	ТоварныйСоставГруза.НовыйТовар КАК НовыйТовар
	|ИЗ
	|	Документ.упПрохождениеТочки.ТоварныйСоставГруза КАК ТоварныйСоставГруза
	|ГДЕ
	|	ИСТИНА
	|	И ТоварныйСоставГруза.Ссылка = &ПрохождениеТочки
	|	И ТоварныйСоставГруза.ЗаданиеНаПеревозкуГруза В(&ЗаданияНаПеревозкуГруза)";


	Запрос.УстановитьПараметр("ЗаданияНаПеревозкуГруза", ЗаданияПоРейсам.Скопировать(Новый Структура("Рейс", ТекущийРейс)).ВыгрузитьКолонку("Задание"));
	Запрос.УстановитьПараметр("ПрохождениеТочки", ПрохождениеТочки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Если товарный состав грузовых мест в прохождении не менялся.
	Если РезультатЗапроса.Пустой() Тогда
		Запрос.Текст = 
		"
		|//{Запрос: 0 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	УпПрохождениеТочки_РаботыТ.ГрузовоеМесто КАК ГрузовоеМесто,
		|	УпПрохождениеТочки_РаботыТ.КоличествоГрузов КАК КоличествоГрузов,
		|	УпПрохождениеТочки_РаботыТ.Задание КАК ЗаданиеНаПеревозкуГруза,
		|	УпПрохождениеТочки_РаботыТ.Выполнена КАК Выполнена,
		|	УпПрохождениеТочки_РаботыТ.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ втГрузовыеМеста
		|ИЗ
		|	Документ.упПрохождениеТочки.Работы КАК УпПрохождениеТочки_РаботыТ
		|ГДЕ ИСТИНА
		|	И УпПрохождениеТочки_РаботыТ.Задание В (&ЗаданияНаПеревозкуГруза)
		|	И УпПрохождениеТочки_РаботыТ.Ссылка = &ПрохождениеТочки
		|	И НЕ (УпПрохождениеТочки_РаботыТ.ГрузовоеМесто В (ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)))
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втГрузовыеМеста.НомерСтроки КАК НомерСтроки,
		|	ЗНАЧЕНИЕ(Справочник.упАдреса.ПустаяСсылка) КАК АдресРазгрузки,
		|	ЗНАЧЕНИЕ(Справочник.упАналитическиеРазрезы.ПустаяСсылка) КАК АналитическийРазрез,
		|	ЛОЖЬ КАК ЕдиныйГруз,
		|	ТоварныйСоставГруза.Количество КАК Количество,
		|	ТоварныйСоставГруза.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.упПроблемы.ПустаяСсылка) КАК Проблема,
		|	ТоварныйСоставГруза.СтавкаНДС КАК СтавкаНДС,
		|	ТоварныйСоставГруза.Сумма КАК Сумма,
		|	ТоварныйСоставГруза.СуммаБезНДС КАК СуммаБезНДС,
		|	ТоварныйСоставГруза.СуммаНДС КАК СуммаНДС,
		|	ТоварныйСоставГруза.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
		|	ТоварныйСоставГруза.Цена КАК Цена,
		|	ПРЕДСТАВЛЕНИЕ(втГрузовыеМеста.ЗаданиеНаПеревозкуГруза) КАК ЗаданиеНаПеревозкуГруза,
		|	ТоварныйСоставГруза.Ссылка КАК ГрузовоеМесто,
		|	втГрузовыеМеста.КоличествоГрузов КАК КоличествоГрузов,
		|	втГрузовыеМеста.Выполнена КАК Выполнена,
		|	ЛОЖЬ КАК НовыйТовар
		|ИЗ
		|	Справочник.упГрузовыеМеста.ТоварныйСоставГруза КАК ТоварныйСоставГруза
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрузовыеМеста КАК втГрузовыеМеста
		|	ПО втГрузовыеМеста.ГрузовоеМесто = ТоварныйСоставГруза.Ссылка
		|";

	КонецЕсли;
	
	тбзРезультат = Запрос.Выполнить().Выгрузить();
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(тбзРезультат);
	
КонецФункции


#КонецЕсли
